public class DataType {

                //Создать пустой проект в IntelliJ IDEA и прописать метод main();//

    public static void main(String[] args) {
                //Создать переменные всех пройденных типов данных, и инициализировать их значения //
            int a= 4;
            short b= 6;
            byte c= 8;
            long d= 10;
            float f= 12.12f;
            double g= 15.165;
            char ch1= 'X';
            boolean y= false;

            System.out.println("Тип данных int: " + a);
            System.out.println("Тип данных short: " + b);
            System.out.println("Тип данных byte: " + c);
            System.out.println("Тип данных long: " + d);
            System.out.println("Тип данных float: " + f);
            System.out.println("Тип данных double: " + g);
            System.out.println("Тип данных char: " + ch1);
            System.out.println("Тип данных boolean: " + y);
    }
}
